python
2021.01.14

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('./data.csv',encoding='cp949')
df

     지역명               규모구분    연도   월 분양가격(㎡)
0     서울                 전체  2015  10    5841
1     서울         전용면적 60㎡이하  2015  10    5652
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     서울        전용면적 102㎡초과  2015  10    5879
...   ..                ...   ...  ..     ...
4585  제주                 전체  2020   3    3955
4586  제주         전용면적 60㎡이하  2020   3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020   3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020   3     NaN
4589  제주        전용면적 102㎡초과  2020   3    3601

[4590 rows x 5 columns]

In [ ]:
df.iloc[2, 1]#범위를 지정해서 찍음

'전용면적 60㎡초과 85㎡이하'

'전용면적 60㎡초과 85㎡이하'

In [ ]:
df[df.index > 3565]

     지역명               규모구분    연도  월 분양가격(㎡)
3566  제주         전용면적 60㎡이하  2019  3    3804
3567  제주   전용면적 60㎡초과 85㎡이하  2019  3    3504
3568  제주  전용면적 85㎡초과 102㎡이하  2019  3    3226
3569  제주        전용면적 102㎡초과  2019  3    2952
3570  서울                 전체  2019  4    7784
...   ..                ...   ... ..     ...
4585  제주                 전체  2020  3    3955
4586  제주         전용면적 60㎡이하  2020  3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4589  제주        전용면적 102㎡초과  2020  3    3601

[1024 rows x 5 columns]

In [ ]:
df[df.연도 == 2019][:5]

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

In [ ]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
copy = df.copy()

In [ ]:
copy.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
# 지역명 == 서울 인 지역만 선택 조건중에 지역명에 맞는거
df.loc[df['지역명']=='서울','지역명'][:10]

0     서울
1     서울
2     서울
3     서울
4     서울
85    서울
86    서울
87    서울
88    서울
89    서울
Name: 지역명, dtype: object

In [ ]:
# 지역명 == 서울 인 지역을 Seoul로 변경(값을 set)
df.loc[df['지역명']=='서울','지역명'] = 'Seoul'
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [ ]:
#인덱스 이름 변경 가능
new_index = [0,1,'a']
df1 = df.reindex(new_index) 
#df1 = df.reindex([0,1,'a'])
df1.head()

     지역명        규모구분      연도     월 분양가격(㎡)
0  Seoul          전체  2015.0  10.0    5841
1  Seoul  전용면적 60㎡이하  2015.0  10.0    5652
a    NaN         NaN     NaN   NaN     NaN

In [ ]:
df1.reindex(new_index,fill_value = 3)

     지역명        규모구분      연도     월 분양가격(㎡)
0  Seoul          전체  2015.0  10.0    5841
1  Seoul  전용면적 60㎡이하  2015.0  10.0    5652
a    NaN         NaN     NaN   NaN     NaN

In [ ]:
df1 = df.reindex(index=df.index[:7], columns=list(df.columns) + ['extra'])
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df1.loc[:4, 'extra'] = False
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df1.loc[:4,'연도']=False
df1

     지역명               규모구분     연도   월 분양가격(㎡)  extra
0  Seoul                 전체  False  10    5841  False
1  Seoul         전용면적 60㎡이하  False  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  False  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  False  10    5721  False
4  Seoul        전용면적 102㎡초과  False  10    5879  False
5     인천                 전체   2015  10    3163    NaN
6     인천         전용면적 60㎡이하   2015  10    3488    NaN

In [ ]:
df2 = df1.copy()
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df2.dropna(how = 'any')
#nan인 값을 없앤다

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [ ]:
df2
#df2값은 그대로

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df2.dropna(how='any',inplace=True)
df2
#df2에 적용됨

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [ ]:
df2 = df1.copy()
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df2.fillna(value='a')
#nan값을 채움

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163      a
6     인천         전용면적 60㎡이하  2015  10    3488      a

# **3. NaN 값이 있는 데이터를 Boolean 값으로 출력**

In [ ]:
pd.isna(df2)
#NaN값이 있는곳만 True로 판별이 가능하다

     지역명   규모구분     연도      월  분양가격(㎡)  extra
0  False  False  False  False    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False
5  False  False  False  False    False   True
6  False  False  False  False    False   True

# **연산**

In [ ]:
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [ ]:
df.mean(0) #열(column)기준 평균
#분양가는 nan값이 있어서 평균이 안뜬다
#mean()안에 0은 열기준 1은 행기준

연도    2017.5
월        6.5
dtype: float64

In [ ]:
#행 기준 평균
df.mean(1)[:5]

0    1012.5
1    1012.5
2    1012.5
3    1012.5
4    1012.5
dtype: float64

In [ ]:
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [ ]:
df.shift(2)[:5]
#행을 2칸 밀기 =>값에는 NaN값

     지역명              규모구분      연도     월 분양가격(㎡)
0    NaN               NaN     NaN   NaN     NaN
1    NaN               NaN     NaN   NaN     NaN
2  Seoul                전체  2015.0  10.0    5841
3  Seoul        전용면적 60㎡이하  2015.0  10.0    5652
4  Seoul  전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882

In [ ]:
df.shift(-2)[:5]
#행을 2칸 당기기

     지역명               규모구분      연도     월 분양가격(㎡)
0  Seoul   전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882
1  Seoul  전용면적 85㎡초과 102㎡이하  2015.0  10.0    5721
2  Seoul        전용면적 102㎡초과  2015.0  10.0    5879
3     인천                 전체  2015.0  10.0    3163
4     인천         전용면적 60㎡이하  2015.0  10.0    3488

# **Broadcasting을 이용한 subtract (빼기)**

In [ ]:
df1 = df[['연도', '월']]
df1.head()
#df에서 연도 월만 가져온것을 df1에 저장

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [ ]:
df.shape#(row,column)

(4590, 5)

In [ ]:
s = np.ones(df.shape[0]) 
#np.ones를 하면 모든 원소를 1, zero를 하면 0
#np.ones(숫자)-> 숫자만큼 1을 넣은 array를 만든다.
s.shape
#list형식이어서 0번째 원소를 가져옴

(4590,)

In [ ]:
s

array([1., 1., 1., ..., 1., 1., 1.])

In [ ]:
df.shape[0]
#1로 차있는 원소를 4590개 만들겠다는 뜻

4590

In [ ]:
np.ones(100)

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [ ]:
s

array([1., 1., 1., ..., 1., 1., 1.])

In [ ]:
df1.sub(s, axis=0).head()
#s의 길이가 4590

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

In [ ]:

df1.head()

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [ ]:
df1.sub(s*2,axis=0).head()

       연도    월
0  2013.0  8.0
1  2013.0  8.0
2  2013.0  8.0
3  2013.0  8.0
4  2013.0  8.0

axis = 0은 행 방향으로 동작합니다.
axis = 1은 열 방향으로 동작합니다.
보통은 매개변수로 0을 쓴다....?ssssssasdf

In [73]:
s = np.ones(df1.shape[1])
s

array([1., 1.])

In [74]:
df1.sub(s, axis=1).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

# **Apply**

In [79]:
df1.apply(np.cumsum)[500:]
#apply는 모든 변수에 동일 함수를 적용

           연도      월
500   1009761   3288
501   1011777   3291
502   1013793   3294
503   1015809   3297
504   1017825   3300
...       ...    ...
4585  9252245  29823
4586  9254265  29826
4587  9256285  29829
4588  9258305  29832
4589  9260325  29835

[4090 rows x 2 columns]

In [80]:
df1.apply(lambda x: x.max() - x.min())
#lambda 연도는 15년부터 20년까지 
#월은 1월부터 12월까지
#x.max() 는 최대값인 2019년도의 2019 x.min() 은 최소값인 2015년도의 2015 2019 - 2015 = 4가 출력

연도     5
월     11
dtype: int64

In [82]:
df1['연도'].value_counts()
#2019연도에 인덱스 카운팅
#연도별로 분양가가 얼마나 나왔는지 카운트 하기 좋음

2019    1020
2018    1020
2017    1020
2016    1020
2015     255
2020     255
Name: 연도, dtype: int64

In [83]:
df1['월'].value_counts()

11    425
3     425
10    425
2     425
1     425
12    425
7     340
6     340
9     340
5     340
8     340
4     340
Name: 월, dtype: int64

In [84]:
df['규모구분'].value_counts()

전용면적 102㎡초과          918
전용면적 60㎡이하           918
전용면적 60㎡초과 85㎡이하     918
전체                   918
전용면적 85㎡초과 102㎡이하    918
Name: 규모구분, dtype: int64

In [86]:
df['지역명'].value_counts()

대구       270
광주       270
충남       270
인천       270
세종       270
경기       270
전북       270
충북       270
경남       270
제주       270
대전       270
경북       270
부산       270
Seoul    270
울산       270
강원       270
전남       270
Name: 지역명, dtype: int64

In [88]:
df[['월','지역명']].value_counts()

월   지역명
12  충북     25
    충남     25
2   울산     25
    인천     25
    전남     25
           ..
6   제주     20
    전북     20
    전남     20
    인천     20
    충북     20
Length: 204, dtype: int64